; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Domain file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
    (:requirements :equality :typing)
    (:types
        block - object
        object
    )

    (:constants
        
    )

    (:predicates
        (on ?x1 - block ?x2 - block)
        (ontable ?x1 - block)
        (clear ?x1 - block)
        (handempty )
        (holding ?x1 - block)
    )

    (:functions
        
    )

    

    
    (:action pick-up
     :parameters (?x - block)
     :precondition (and (clear ?x) (ontable ?x) (handempty ))
     :effect (and
        (not (ontable ?x))
        (not (clear ?x))
        (not (handempty ))
        (holding ?x))
    )


    (:action put-down
     :parameters (?x - block)
     :precondition (holding ?x)
     :effect (and
        (not (holding ?x))
        (clear ?x)
        (handempty )
        (ontable ?x))
    )


    (:action stack
     :parameters (?x - block ?y - block)
     :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)))
     :effect (and
        (not (holding ?x))
        (not (clear ?y))
        (clear ?x)
        (handempty )
        (on ?x ?y))
    )


    (:action unstack
     :parameters (?x - block ?y - block)
     :precondition (and (on ?x ?y) (clear ?x) (handempty ) (not (= ?x ?y)))
     :effect (and
        (holding ?x)
        (clear ?y)
        (not (clear ?x))
        (not (handempty ))
        (not (on ?x ?y)))
    )

)

; problem
(define (problem blocks_words)
	(:domain blocks)
(:objects 

M O T H E R W A - block
)
(:init
(HANDEMPTY)
(CLEAR M)
(ON M O)
(ONTABLE O)
(CLEAR E)
(ONTABLE E)
(CLEAR T)
(ON T W)
(ONTABLE W)
(CLEAR H)
(ONTABLE H)
(CLEAR R)
(ON R A)
(ONTABLE A)
)
(:goal (and
(CLEAR T)  (ONTABLE O)  (ON T W)  (ON W O)

))
)

; plan
1. (unstack t w)
   deleted: (clear t) (handempty) (on t w)
   added: (holding t) (clear w)
   goals met: 1 of 4
2. (stack t h)
   deleted: (holding t) (clear h)
   added: (clear t) (handempty) (on t h)
   goals met: 2 of 4
3. (unstack m o)
   deleted: (clear m) (handempty) (on m o)
   added: (holding m) (clear o)
   goals met: 2 of 4
4. (stack m e)
   deleted: (holding m) (clear e)
   added: (clear m) (handempty) (on m e)
   goals met: 2 of 4
5. (pick-up w)
   deleted: (ontable w) (clear w) (handempty)
   added: (holding w)
   goals met: 2 of 4
6. (stack w o)
   deleted: (holding w) (clear o)
   added: (clear w) (handempty) (on w o)
   goals met: 3 of 4
7. (unstack t h)
   deleted: (clear t) (handempty) (on t h)
   added: (holding t) (clear h)
   goals met: 2 of 4
8. (stack t w)
   deleted: (holding t) (clear w)
   added: (clear t) (handempty) (on t w)
   goals met: 4 of 4
